
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'adns'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'aws-sam-cli'
brew 'awscli'
brew 'bdw-gc'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'certifi'
brew 'cffi'
brew 'clingo'
brew 'cmake'
brew 'colordiff'
brew 'cryptography'
brew 'curl'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fribidi'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'highway'
brew 'httpie'
brew 'icu4c'
brew 'imath'
brew 'jansson'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'jsoncpp'
brew 'jsonnet'
brew 'krb5'
brew 'lazydocker'
brew 'libassuan'
brew 'libavif'
brew 'libcbor'
brew 'libev'
brew 'libevent'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'libmetalink'
brew 'libnghttp2'
brew 'libpng'
brew 'libpq'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libsodium'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'lua@5.3'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mpdecimal'
brew 'mysql'
brew 'mysql@5.7'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'nodebrew'
brew 'npth'
brew 'oniguruma'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@17'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pipenv'
brew 'pixman'
brew 'pkg-config'
brew 'protobuf'
brew 'protobuf@21'
brew 'pv'
brew 'pycparser'
brew 'pyenv'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.8'
brew 'python@3.9'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rtmpdump'
brew 'six'
brew 'sqlite'
brew 'tcl-tk'
brew 'terraform'
brew 'tfenv'
brew 'tidy-html5'
brew 'tmux'
brew 'unbound'
brew 'unixodbc'
brew 'utf8proc'
brew 'webp'
brew 'xorgproto'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zstd'

tap 'homebrew/cask'
cask 'alfred'
cask 'docker'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'microsoft-remote-desktop'
cask 'powershell'
cask 'sourcetree'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'argon/mas'

tap 'aws/tap'

tap 'gobuffalo/tap'
brew 'buffalo'

tap 'jesseduffield/lazydocker'

tap 'kayac/tap'
brew 'ecspresso'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'songmu/tap'
brew 'ecschedule'

# App Store applications
mas 'GarageBand (10.4.10)', id: 682658836
mas 'iMovie (10.4)', id: 408981434
mas 'Keynote (13.2)', id: 409183694
mas 'Magnet (2.14.0)', id: 441258766
mas 'Numbers (13.2)', id: 409203825
mas 'Pages (13.2)', id: 409201541
mas 'Slack (4.38.115)', id: 803453959
mas 'Xcode (15.3)', id: 497799835
